Repository: 84000/data-translation-memory
Catalog: toh139-v4.tmx
Source language: bo
Languages: en

source: མ་རིག་པ་དེ་ཡང་སའི་ཁམས་དང་མ་འདྲེས། ཆུའི་ཁམས་དང་མ་ཡིན། མེའི་ཁམས་དང་མ་ཡིན། རླུང་གི་ཁམས་དང་མ་ཡིན། ནམ་མཁའི་ཁམས་དང་མ་ཡིན། རྣམ་པར་ཤེས་པའི་ཁམས་དང་མ་འདྲེས་པའོ།
en: And ignorance is not mixed with the elements of earth, water, fire, air, space, or consciousness.

source: །འཇམ་དཔལ་མ་འདྲེས་པའི་ཆོས་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་མི་འགྱུར་ཞིང་རྣམ་པར་བྱང་བར་མི་འགྱུར་རོ།
en: Mañjuśrī, unmixed phenomena cannot be polluted and cannot be purified.

source: །འཇམ་དཔལ་གལ་ཏེ་མ་འདྲེས་པའི་ཆོས་དེ་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་འགྱུར་བའམ། རྣམ་པར་བྱང་བར་འགྱུར་དུ་ཟིན་ན། ནམ་མཁའ་ཡང་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་འགྱུར་ཞིང་རྣམ་པར་བྱང་བར་འགྱུར་རོ།
en: Mañjuśrī, if unmixed phenomena could be polluted or purified, then the element of space, too, could be polluted or purified.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འཇམ་དཔལ་ནམ་མཁའ་ནི་ཆོས་གང་དང་ཡང་མ་འདྲེས་པ་སྟེ།
en: Mañjuśrī, it is because space is not mixed with any other factor.

source: འཇམ་དཔལ་གང་མ་རིག་པ་དང་མ་འདྲེས་པ། མི་འཕོ་བ། འདུལ་བ་མ་ཡིན་པ། ཡོད་པ་མ་ཡིན་པ། མ་བྱུང་བ། དངོས་པོ་མེད་པ། མི་མཐོང་བ། མི་སྣང་བ། གཟུང་དུ་མེད་པ། མ་བཅིངས་པ། མ་གྲོལ་བ། ཚད་མེད་པ། ཡ་མ་བརླ། གསོབ། གསོག་སྟོང་པ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཞེའམ། རྣམ་པར་བྱང་བ་ཞེས་བརྗོད་པར་བྱའམ།
en: Mañjuśrī, is it possible to designate as either ‘polluted’ or ‘purified’ something that is not mixed with ignorance, does not migrate, is not restrained, does not exist, does not arise, is a nonentity, is not seen, does not appear, is not grasped, is not bound, is not liberated, is immeasurable, is void, is vain, or has no substance?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: “No, Blessed One,” replied Mañjuśrī.

source: །བཀའ་སྩལ་པ། འཇམ་དཔལ་མ་རིག་པ་མ་རིག་པ་ཞེས་དེ་བཞིན་གཤེགས་པས་བསྟན་པ་དེའི་ཐོག་མ་མེད་དོ།
en: “So too, Mañjuśrī,” said the Blessed One, “that which the thus-gone ones have taught to be ignorance is without beginning.

source: །རྟག་ཏུ་གཅིག་པ་ཉིད་ཀྱང་མེད་དོ།
en: It always lacks singularity.

source: །ཐོག་མའི་མཐའ་ཡང་མེད། ཐ་མའི་མཐའ་ཡང་མེད། ད་ལྟར་བྱུང་བ་ཡང་མེད་དེ།
en: It is without a beginning point, without an ending point, and also does not exist in the present.

source: དེས་ན་མ་རིག་པ་ཞེས་བྱའོ།
en: Therefore, it is called ignorance.

source: །འཇམ་དཔལ་ཆོས་གང་མེད་ཅིང་མི་རྙེད། རྣམ་པར་མི་རིག །མི་སྣང་། མི་ཆགས། རྣམ་པར་མི་ཆགས། ཞེ་མི་སྡང་། གཏི་མི་མུག་པ་སྟེ། ཆོས་གང་ལ་ཡང་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། སྒྲིབ་པའི་བྱ་བ་བྱེད་དམ། གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: “Mañjuśrī, can any such phenomenon that is nonexistent, unfindable, unknowable, imperceptible, does not come to be, and is not an object of desire, anger, or confusion be something that could be polluted, purified, or obscured?” “No, Blessed One.

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ།
en: No, Sugata,” said Mañjuśrī.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ནི་མ་རིག་པའི་ཆོས་གང་ལ་ཡང་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། སྒྲིབ་པའི་བགྱི་བ་མི་བགྱིད་ན། ཇི་ལྟར་ན་བཅོམ་ལྡན་འདས་ཀྱིས་མ་རིག་པ་ཀུན་ནས་ཉོན་མོངས་པ་ཞེས་བཀའ་སྩལ།
en: “Blessed One, if it is true that any phenomenon related to ignorance is not something that could be polluted, purified, or obscured, then why did the Blessed One refer to ignorance as ‘polluted’?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: The Blessed One replied, “Allow me to provide an example, Mañjuśrī.

source: གཙུབ་ཤིང་དང་གཙུབ་སྟན་ལ་ཡང་བརྟེན། མིའི་ལག་པས་གཙུབས་པ་ལ་ཡང་བརྟེན་ནས་དུ་བ་འབྱུང་ཞིང་མེ་མངོན་པར་འགྲུབ་སྟེ། མེ་དེ་ཡང་གཙུབ་ཤིང་ལ་ཡང་མི་གནས། གཙུབ་སྟན་ལ་ཡང་མི་གནས། མིའི་ལག་པས་གཙུབས་པ་ལ་ཡང་མི་གནས་སོ།
en: Smoke arises and fire appears when one uses a rubbing stick, the wooden base for the rubbing stick, and the rubbing action of a person’s hand, but that fire is not present in the rubbing stick, the wooden base, or the rubbing action of a person’s hand.

source: །འཇམ་དཔལ་དེ་བཞིན་དུ་སྐྱེས་བུ་གང་ཟག་རྨོངས་པ་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་ཡོངས་སུ་གདུང་བའི་མེ་འབྱུང་སྟེ། ཡོངས་སུ་གདུང་བ་དེ་ཡང་ནང་ན་ཡང་མི་གནས། ཕྱི་རོལ་ན་ཡང་མི་གནས། གཉི་ག་མེད་པར་ཡང་མི་གནས་མོད་ཀྱི།
en: In the same way, Mañjuśrī, the tormenting fires of desire, anger, and confusion arise in a confused person, but that torment does not dwell within, without, or as neither of those possibilities.

source: འཇམ་དཔལ་འོན་ཀྱང་གཏི་མུག་ཅེས་བྱའོ།
en: Nevertheless, we speak of confusion, Mañjuśrī.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་གྲོལ་བ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Because, Mañjuśrī, all phenomena are already totally free.

source: ཆོས་གང་ཤིན་ཏུ་གྲོལ་བ་དེ་ནི་གཟུངས་ཀྱི་གཞི་ཞེས་བྱའོ།
en: And phenomena that are totally free we call the basis of the dhāraṇī.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྒོ་གང་དང་ལྡན་ན། ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་གཟུངས་ཐོབ་པར་འགྱུར་བའི་ཆོས་ཀྱི་སྒོ་འགའ་མཆིས་ལགས་སམ།
en: Mañjuśrī then asked the Blessed One, “Is there some Dharma gate a bodhisattva can possess that leads to attaining the dhāraṇī that is in accord with everything?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྒོ་གང་དང་ལྡན་ན། ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་གཟུངས་ཐོབ་པའི་ཆོས་ཀྱི་སྒོ་ཡོད་དེ།
en: The Blessed One replied, “Mañjuśrī, there is a Dharma gate a bodhisattva can possess that leads to attaining the dhāraṇī that is in accord with everything.

source: ཡི་གེ་གཅིག་ལས་ཡི་གེ་འབུམ་དུ་བཤད་ཀྱང་ཡི་གེ་དེའི་མཐའ་མི་རྟོགས་ཏེ།
en: Even if one were to teach it using a single syllable or up to a hundred thousand syllables, one would never know the limit of those syllables.

source: ཆོས་ཀྱི་སྒོ་གང་དང་གང་གིས་བཤད་པའི་ཆོས་ཀྱི་སྒོ་དེ་དང་དེ་ལས་ཆོས་ཀྱི་སྒོ་མཐའ་ཡས་པ་དག་སྣང་བར་འགྱུར་ཞིང་སྤོབས་པ་ཡང་ཐོགས་པ་མེད་དོ། །དེ་སྤོབས་པ་ཡང་ཐོགས་པ་མེད་པའི་ཕྱིར་ཆོས་ཀྱི་སྒོ་ཐམས་ཅད་བརྗོད་དོ།
en: Their eloquence is limitless, and it is that limitless eloquence which expresses all Dharma gates.

source: །ཆོས་ཀྱི་སྒོའི་ཚིག་གཅིག་ལ་ཆོས་ཀྱི་སྒོའི་ཚིག་ཐམས་ཅད་རྗེས་སུ་འཇུག་པར་བྱེད་དོ། །ཆོས་ཀྱི་སྒོའི་ཚིག་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྒོའི་ཚིག་གཅིག་རྗེས་སུ་འཇུག་པར་བྱེད་དོ།
en: All the words of the Dharma gates are included within a single word of the Dharma gates, while a single word of the Dharma gates is included in every word of the Dharma gates.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་སྒོ་དེ་ཇི་ལྟ་བུ་ཞིག་ལགས།
en: Mañjuśrī asked, “Blessed One, what are these Dharma gates?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ལྷའི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are gates of the gods and this is the basis of the dhāraṇī.”

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་དེ་གཟུངས་ཀྱི་གཞི་ལགས།
en: “Blessed One, how is this the basis of the dhāraṇī?” asked Mañjuśrī.

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་འདུལ་བའི་ས་ལ་གནས་པ་སྟེ། དེ་ནི་ལྷ་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are present as a basis for spiritual discipline, and this is the basis for the dhāraṇī through which the likes of gods enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ཀླུའི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for nāgas, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་མིང་མེད་པ། ཡི་གེ་ཡོངས་སུ་ཆད་པ། ཡི་གེ་མེད་པ། ཡི་གེས་ཡོངས་སུ་བརྗོད་པ་སྟེ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are nameless, devoid of syllables, without syllables, and yet they are expressed through syllables.

source: དེ་ནི་ཀླུ་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: That is the basis of the dhāraṇī through which the likes of nāgas enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་གནོད་སྦྱིན་གྱི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for yakṣas, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པའི་ཕྱིར་མི་ཟད་པའི་རྣམ་པར་ཞུགས་པའི་སྒོ་སྟེ།
en: “Mañjuśrī,” replied the Blessed One, “because all phenomena are unborn, they are gates to dwelling in the inexhaustible.

source: དེ་ནི་གནོད་སྦྱིན་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: That is the basis of the dhāraṇī through which the likes of yakṣas enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་དྲི་ཟའི་སྒོ་སྟེ། དེ་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for gandharvas, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ཚད་མེད། གྲངས་མེད། དཔག་ཏུ་མེད། ནམ་མཁའ་དང་མཉམ་པའི་ཕྱིར་བགྲང་བ་ལས་འདས་པ་སྟེ།
en: “Mañjuśrī,” replied the Blessed One, “because all phenomena are limitless, innumerable, unfathomable, and equal to space, they are beyond counting.

source: དེ་ནི་དྲི་ཟ་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: That is the basis of the dhāraṇī through which the likes of gandharvas enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ལྷ་མ་ཡིན་གྱི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are a Dharma gate for asuras, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་མེད་པའི་སྒོ་སྟེ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are gates to nonexistence.

source: མིང་དུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as name.

source: གཟུགས་སུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as form.

source: སྒྲར་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as sound.

source: དྲིར་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as smell.

source: རོར་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as taste.

source: རེག་པར་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as sensation.

source: ཡིད་དུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as mind.

source: སངས་རྒྱས་སུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as the Buddha.

source: ཆོས་སུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as the Dharma.

source: དགེ་འདུན་དུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as the Saṅgha.

source: ཉན་ཐོས་སུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as a hearer.

source: རང་སངས་རྒྱས་སུ་རིག་པར་བྱ་བ་མ་ཡིན།
en: They cannot be known as a solitary buddha.

source: སོ་སོ་སྐྱེ་བོར་རིག་པར་བྱ་བ་མ་ཡིན་ཞིང་།
en: They cannot be known as an ordinary person.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་ཀུན་ནས་མ་སྐྱེས་པའི་ཚུལ་གྱིས་རིག་པར་བྱ་བ་མ་ཡིན་པ་སྟེ། དེ་ནི་ལྷ་མ་ཡིན་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: Mañjuśrī, by virtue of their utter lack of origination no phenomena are knowable, and that is the basis of the dhāraṇī through which the likes of asuras enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་ལྡིང་གི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for garuḍas, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་འོང་བ་མེད་ཅིང་འགྲོ་བ་མེད་པ་སྟེ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are without coming or going.

source: མི་རྒྱུག་པ། རྣམ་པར་མི་རྒྱུག་པ།
en: They are without running or running away.

source: མི་འབྲོས་པ། མི་འགྲོ་བ། མི་འོང་བ། མི་འཕོ་བ། མི་སྐྱེ་བ། མི་རྟེན་པ། མི་གནས་པ། མི་ཆགས་པ། མི་འཆིང་བ། ཞེ་མི་སྡང་བ། གཏི་མི་མུག་པ། མི་འགྲོལ་བ། མི་གནས་པ། རབ་ཏུ་མི་གནས་པ་སྟེ།
en: They are not fleeing, not going, not coming, not passing away, not being born, not supporting, not remaining, not being attached, not bound, not angered, not confused, not freed, not persisting, and not stationary.

source: འཇམ་དཔལ་ནམ་མཁའ་ལ་ཆགས་པ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ནི་གནས་པ་མེད་པའི་སྒོ་སྟེ། དེ་ནི་ནམ་མཁའ་ལྡིང་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: Mañjuśrī, since no attachment exists in space, all factors are gates to freedom from dwelling, and that is the basis of the dhāraṇī through which the likes of garuḍas enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་མིའམ་ཅིའི་སྒོ་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for kinnaras, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་པོ་ལས་ལོག་པ་སྟེ། མ་བྱས་པ། མི་འགྱུར་བ། བྱེད་པ་པོ་ཀུན་ཏུ་བསལ་ན་མི་རྙེད་པ་སྟེ། འཇམ་དཔལ་དེ་ནི་མི་འམ་ཅི་ལྟ་བུའི་སྒོར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are devoid of agent. They are uncreated, unchanging, and no agent will be found upon investigation. That is the basis of the dhāraṇī through which the likes of kinnaras enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for mahoragas, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་དྲི་མ་དང་བྲལ་ཞིང་ཤིན་ཏུ་འོད་གསལ་བ་སྟེ།
en: “Mañjuśrī,” replied the Blessed One, “all phenomena are free of stains and luminous.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་བྱ་བའམ། རྣམ་པར་བྱང་བར་བྱར་མི་ནུས་པ་དེ་ནི་རྣམ་པར་དག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: The fact that sentient beings are unable to make them into something polluted or something to be purified is the basis for the dhāraṇī of purity.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་ཕྱིར་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྟེ།
en: Mañjuśrī, because all phenomena are by nature unborn, they are always parinirvāṇa.

source: དེ་ནི་ལྟོ་འཕྱེ་ཆེན་པོ་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: That is the basis of the dhāraṇī through which the likes of mahoragas enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་བུད་མེད་ཀྱི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for women, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ཕྱིར་མི་བདེན་པ།
en: “Mañjuśrī,” replied the Blessed One, “because all phenomena lack true existence, they are unreal.

source: སྐྱེས་པའི་དབང་པོ་དང་། བུད་མེད་ཀྱི་དབང་པོ་དང་བྲལ་བ་སྟེ།
en: They are without female or male genitalia.

source: དེ་ནི་བུད་མེད་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: That is the basis of the dhāraṇī through which the likes of women enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་སྐྱེས་པའི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are Dharma gates for men, and this is the basis of the dhāraṇī.”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་རྣམ་པ་ཐམས་ཅད་དུ་སྐྱེས་པ་ཉིད་ནི་མི་དམིགས་ཏེ།
en: “Mañjuśrī,” replied the Blessed One, “maleness is not apprehended in any way:

source: ཐོག་མའི་མཐར་ཡང་མི་དམིགས། ཐ་མའི་མཐར་ཡང་མི་དམིགས། ད་ལྟར་བྱུང་བར་ཡང་མི་དམིགས་སོ།
en: it is not apprehended at a beginning point, at an ending point, or at present.

source: །འཇམ་དཔལ་གང་དུས་གསུམ་དུ་མི་དམིགས་པ་དེ་ལ་སྐྱེས་པ་ཡང་མེད། བུད་མེད་ཀྱང་མེད་དེ།
en: Mañjuśrī, something that is not apprehended in the three times cannot be male or female.

source: གཞན་དུ་ན་མིང་གི་བརྡས་བརྗོད་པར་ཟད་དོ།
en: In other words, these are simply nominal expressions.

source: །མིང་དེ་ཡང་དབེན་པ་སྟེ། གཟུངས་ཀྱི་བརྡས་དེ་དག་བཏགས་སོ།
en: Those names, too, are void and they are ascribed by virtue of the verbal sign of the dhāraṇī.

source: །གཟུངས་དེ་ཡང་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ་སྟེ། འབྱུང་བ་ཆེན་པོ་བཞི་རྣམས་ཀྱི་སྐྱེ་བ་ཡང་མི་དམིགས་སོ།
en: That dhāraṇī, too, is arisen out of the four great elements of earth, water, air, and fire, and the arising of the four elements is not apprehended.

source: །ཆོས་ཐམས་ཅད་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྟེ།
en: Since all phenomena are not born, all phenomena are always parinirvāṇa.

source: དེ་ནི་སྐྱེས་པ་ལྟ་བུར་འཇུག་པའི་གཟུངས་ཀྱི་གཞིའོ།
en: That is the basis of the dhāraṇī through which the likes of men enter.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་དམྱལ་བའི་སྒོ་སྟེ། འདི་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, all phenomena are a Dharma gate for hell beings, and this is the basis of the dhāraṇī.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་སེམས་ཅན་དམྱལ་བ་གང་དུ་ཡང་དག་པར་འདུ་བར་འགྱུར།
en: “Mañjuśrī,” replied the Blessed One, “how are hells arranged?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་སེམས་ཅན་དམྱལ་བ་ནི་ནམ་མཁའ་ཡང་དག་པར་འདུ་བ་ལགས་སོ།
en: “Blessed One, hells are arranged in space,” said Mañjuśrī.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Mañjuśrī, how do you think this happens?” asked the Blessed One.

source: སེམས་ཅན་དམྱལ་བ་རང་གི་རྟོག་པ་ལས་བྱུང་ངམ།
en: “Have the hells arisen from one’s own thoughts?

source: འོན་ཏེ་ངོ་བོ་ཉིད་ལས་བྱུང་།
en: Or have they arisen from their own nature?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་རང་གི་རྟོག་པས། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་རིག་སྟེ།
en: “Blessed One,” replied Mañjuśrī, “it is through their own thoughts that immature ordinary people imagine themselves to be hell beings, animals, or spirits in the world of Yama.

source: དེ་དག་མ་མཆིས་པ་ལ་སྒྲོ་བཏགས་པའི་སླད་དུ། ངན་སོང་གསུམ་དུ་གནོད་པ་ཚོར་ཞིང་སྡུག་བསྔལ་མྱོང་ལགས་སོ།
en: And it is on account of projecting something that does not exist that they feel afflictions and experience miseries in the three lower realms.

source: །བཅོམ་ལྡན་འདས་བདག་གིས་སེམས་ཅན་དམྱལ་བ་ཇི་ལྟར་མི་མཐོང་བ་དེ་བཞིན་དུ་སེམས་ཅན་དམྱལ་བ་པ་རྣམས་མི་མཐོང་སྟེ། སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཡང་མ་མཆིས་སོ།
en: However, Blessed One, since I do not see hells, I also do not see hell beings, and the sufferings of hells do not exist, either.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་མི་ལ་ལ་ཞིག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན་བདག་སེམས་ཅན་དམྱལ་བར་ལྟུང་བ་སྙམ་དུ་རིག་ནས།
en: For instance, Blessed One, suppose that some man who has fallen asleep were to imagine in a dream that he is experiencing falling into the hell realms.

source: དེ་དེ་ན་ལྕགས་ཀྱི་བུམ་པ་རབ་ཏུ་ཁོལ་བ། ཤིན་ཏུ་འབར་བ་འདོམ་དུ་མ་མཆིས་པའི་ནང་ན་བདག་བཅུག་ནས་དེ་དེ་ན་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བར་རབ་ཏུ་འཚལ་ཏེ།
en: He vividly imagines that he has been put into a boiling iron cauldron several fathoms deep with intensely burning flames where he experiences sensations of suffering.

source: དེ་ཡིད་དངངས་ཤིང་ཡོངས་སུ་གདུང་བར་རིག་ནས་འཇིགས་སྐྲག་སྟེ་དངངས་ནས། དེ་སླར་སད་པ་དང་། ཀྱེ་མའོ་སྡུག་བསྔལ་ལོ། །ཀྱེ་མ་སྡུག་བསྔལ་ལོ་ཞེས་ཆོ་ངེས་འདེབས་ན་དེའི་མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། ཕུ་ནུ་རྣམས་ཀྱིས་ཁྱོད་ཅིས་སྡུག་བསྔལ་ཞེས་དྲིས་པ་དང་། མི་དེས་དེ་དག་ལ་འདི་སྐད་ཅེས་བདག་ནི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་བ་མྱོང་ངོ་། །ཞེས་སྨྲས་ནས།
en: Perceiving this with fear and anguish, he may wake up in a state of shock and terror, thinking, ‘Aaah! The pain!’ When he shouts such words out loud, his friends, kinsmen, or siblings nearby might ask, ‘What is paining you?’ “The man might then say to them, ‘I was experiencing the pains of hell.’

source: ཡང་དེ་མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། ཕུ་ནུ་རྣམས་ལ་གཤེ་ཞིང་འཚིག་སྟེ། བདག་ནི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་བ་མྱོང་ན། ཁྱོད་ཀྱིས་སླར་ཕྱི་ཕྱིར་ཞིང་ང་ལ་ཅིས་སྡུག་བསྔལ་ཞེས་དྲིར་ཅི་ཡོད་ཅེས་མཆི་ལ།
en: Then, feeling irritated and angry with those friends, kinsmen, or siblings, he might add, ‘I have been experiencing the pains of hell, so what business do you have to ask me afterward, “What is paining you?” ’

source: དེ་ནས་མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། ཕུ་ནུ་དེ་དག་གིས་མི་དེ་ལ་འདི་སྐད་ཅེས། ཀྱེ་མ་འཇིགས་ཤིག །མ་འཇིགས་ཤིག །མི་ཁྱོད་ནི་གཉིད་ཀྱིས་ལོག་སྟེ་ཁྱིམ་འདི་ནས་གར་ཡང་མ་སོང་ངོ་། །ཞེས་བགྱིས་པ་དང་།
en: In response, those friends, kinsmen, or siblings would say to him, ‘Hey! Don’t be afraid! Don’t be afraid! You fell asleep. You never left this house.’

source: མི་དེས་སླར་དྲན་པ་རྙེད་ནས་བདག་ནི་གཉིད་ཀྱིས་ལོག་སྟེ། ཡང་དག་པ་མ་ཡིན་པ་དངོས་པོ་མེད་པ་དེ་ལ་བདག་གིས་བརྟགས་པར་ལྟ་ཞིག་སྟེ།
en: “Once that man has fully regained consciousness, he might think, ‘I did fall asleep and then I imagined something that was not real and that did not actually exist.

source: དངོས་པོ་ཅི་ཡང་མེད་དོ་སྙམ་བགྱིད་ནས། དེ་སླར་ཡང་ཡིད་བདེ་བ་རྙེད་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་མི་དེ་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན། མ་མཆིས་པ་ལ་སྒྲོ་བཏགས་ནས་བདག་སེམས་ཅན་དམྱལ་བར་མཆིས་སོ་སྙམ་དུ་རིག་པ་དེ་བཞིན་དུ། བཅོམ་ལྡན་འདས་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་མཆིས་པ་མ་ལགས་པའི་འདོད་ཆགས་ཀྱིས་ཀུན་ཏུ་དཀྲིས་པས་བུད་མེད་ཀྱི་མཚན་མར་རྟོག་གོ།
en: Nothing really existed.’ Now, Blessed One, just as that man projected something that didn’t exist during the dream he had when he had fallen asleep and imagined that he was in hell, so it is, Blessed One, that all immature ordinary men, entangled in their desire for what is nonexistent, imagine the genitalia of a woman.

source: །དེ་དག་གིས་བུད་མེད་ཀྱི་མཚན་མར་བརྟགས་ནས། བུད་མེད་དང་བདག་ལྷན་ཅིག་ཏུ་རྩེ་དགའ་ཞིང་དགའ་དགུར་སྤྱོད་པར་རིག་སྟེ།
en: Having imagined her genitalia, they fancy that they are playing around with the woman and enjoying sex together.

source: དེ་དག་འདི་སྙམ་དུ་བདག་ནི་སྐྱེས་པ། འདི་ནི་བུད་མེད་དོ།
en: They may think, ‘I am a man and this is a woman.

source: །འདི་ནི་བདག་གི་བུད་མེད་དོ་སྙམ་ནས། དེ་སྲེད་པའི་འདོད་ཆགས་ཀྱིས་ཀུན་ཏུ་དཀྲིས་པའི་སེམས་ཀྱིས་དེ་ལོངས་སྤྱོད་ཚོལ་བར་སེམས་གཏད་དོ།
en: This is my woman.’ Then, with a mind entangled in lustful passion, they set their minds on the pursuit of pleasure.

source: །དེ་གཞི་དེ་ལས་འཐབ་པ་དང་འགྱེད་པ་དང་། རྩོད་པ་སྐྱེད་དེ། དེའི་དབང་པོ་རབ་ཏུ་ཁྲོས་པས་འཁོན་བྱུང་ངོ་།
en: From that starting point, they get into fights, quarrels, and disputes, and with their faculties enraged, they harbor resentment.

source: །དེ་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་པ་དེས་གུམ་མ་ཐག་ཏུ་བསྐལ་པ་སྟོང་ཕྲག་མང་པོར་བདག་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཉམས་སུ་མྱོང་བ་སྙམ་དུ་འཚལ་ཏོ།
en: Due to such erroneous conceptions, as soon as these people die, they will think they are experiencing for many thousands of eons the painful sensations of hell.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། མི་དེ་ལ་མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། ཕུ་ནུ་རྣམས་ཀྱིས་འདི་སྐད་ཅེས་མ་འཇིགས་ཤིག །མ་འཇིགས་ཤིག །མི་ཁྱོད་ནི་གཉིད་ཀྱིས་ལོག་སྟེ།
en: “Blessed One, just as that man was told by his friends, kinsmen, or siblings, ‘Hey! Don’t be afraid! Don’t be afraid! You fell asleep.

source: ཁྱིམ་འདི་ནས་གར་ཡང་མ་སོང་ངོ་། །ཞེས་མཆི་བ་ལྟར། བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱིན་ཅི་ལོག་བཞིས་རྣམ་པར་མྱོས་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་ཏེ།
en: You never left this house,’ so it is, Blessed One, that the blessed buddhas have taught the Dharma to the sentient beings who are intoxicated by the four erroneous conceptions.

source: འདི་ལ་བུད་མེད་ཀྱང་མེད། སྐྱེས་པ་ཡང་མེད།
en: Here there exists no woman and also no man.

source: སེམས་ཅན་ཡང་མེད། སྲོག་ཀྱང་མེད། གསོ་བ་ཡང་མེད། གང་ཟག་ཀྱང་མེད།
en: Here there is no sentient being, no life force, no wellbeing, and no person.

source: ཆོས་འདི་དག་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་པའོ།
en: All these phenomena are unreal.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་མེད་པའོ།
en: All these phenomena are nonexistent.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་རྣམ་པར་བསྒྲུབས་པའོ།
en: All these phenomena are fabricated.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་བརྟགས་པའོ།
en: All these phenomena are imagined.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་སྟོང་པའོ།
en: “All these phenomena are empty.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་པའོ།
en: All these phenomena are without origination.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་འགག་པ་མེད་པའོ།
en: All these phenomena are without cessation.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའོ།
en: All these phenomena are nonentities.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་མ་འབྲེལ་པའོ།
en: All these phenomena are disconnected.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་རྨི་ལམ་ལྟ་བུའོ།
en: All these phenomena are like a dream.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་སྒྱུ་མ་ལྟ་བུའོ།
en: All these phenomena are like an illusion.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་ཆུ་ཟླ་ལྟ་བུ་སྟེ།
en: All these phenomena are like the moon’s reflection in water.

source: འདི་ལ་སུ་ཡང་མི་ཆགས་མི་སྡང་མི་རྨོངས་ཏེ།
en: These beings are taught, ‘No one should be desirous, angry, or confused about these things.

source: ཡང་དག་པ་མ་ཡིན་པ་ལ་མ་རྟོགས་ཤིག་ཅེས་བསྟན་པ་དང་། དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ཆོས་དེ་ཐོས་ནས། ཆོས་ཐམས་ཅད་ལ་འདོད་ཆགས་མ་མཆིས་པར་མཐོང་ངོ་།
en: So don’t think about what is unreal!’ Upon hearing that teaching of the Thus-Gone One, they see that all phenomena are without desire.

source: །ཆོས་ཐམས་ཅད་ལ་ཞེ་སྡང་མ་མཆིས་པ་དང་། གཏི་མུག་མ་མཆིས་པ་དང་། སྒྲིབ་པ་མ་མཆིས་པ་དང་། ཆགས་པ་མ་མཆིས་པར་མཐོང་ངོ་།
en: They see that all phenomena are without anger, without confusion, without obscuration, and without attachment.

source: །ཆོས་ཐམས་ཅད་ཤིན་ཏུ་གྲོལ་བ་དང་། གཏན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་མཐོང་ནས། དེ་དག་སེམས་ནམ་མཁའ་ལ་གནས་ཏེ། འགུམ་པའི་དུས་བགྱིས་སོ།
en: Having seen that all entities are already fully liberated and are always parinirvāṇa, they will die with their minds dwelling in space.

source: །འགུམ་པའི་དུས་བགྱིས་མ་ཐག་ཏུ་ཕུང་པོའི་ལྷག་མ་མ་མཆིས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དེ་ཡང་དེ་དང་འདྲ་སྟེ།
en: As soon as they die, they will pass into the realm of final nirvāṇa that is without remainder.

source: བཅོམ་ལྡན་འདས་བདག་གིས་སེམས་ཅན་དམྱལ་བ་དེ་ལྟར་མཐོང་ལགས་སོ།
en: That, Blessed One, is how I see the hell realms.”
